puts "Вкажіть перше ціле число (не дорівнює 0) : "
    a=gets.chomp
    a = a.to_i

    puts "Вкажіть друге ціле число (не дорівнює 0 та не дорівнює 1) : "
    b=gets.chomp
    b = b.to_i

    while a==0 || b==0 || b==1 do
            puts "Error | Спробуйте ще раз"
                puts "Вкажіть перше ціле число (не дорівнює 0) : "
                a=gets.chomp
                a = a.to_i

                puts "Вкажіть друге ціле число (не дорівнює 0 та не дорівнює 1) : "
                b=gets.chomp
                b = b.to_i
    end

    puts "Отримана функція: #{a*b}x^#{b-1}"